Revit 2027 API
BuiltInFailures.DimensionFailures.MoreThanOneDimsLabelToOneReportingParameter Property
 Reporting parameters can only exist on a single dimension/constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MoreThanOneDimsLabelToOneReportingParameter { get; }
Public Shared ReadOnly Property MoreThanOneDimsLabelToOneReportingParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MoreThanOneDimsLabelToOneReportingParameter {
	FailureDefinitionId^ get ();
}
static member MoreThanOneDimsLabelToOneReportingParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace